Show / Hide Table of Contents
Class OpenModel
Open model
Inheritance
System.Object
OpenModel
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
public class OpenModel
Constructors
Improve this Doc   View Source
OpenModel()
Constructor
Declaration
public OpenModel()
Properties
Improve this Doc   View Source
ArcSegment3D
List of ArcSegment3D
Declaration
public List<ArcSegment3D> ArcSegment3D { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ArcSegment3D>
Improve this Doc   View Source
Attribute
List of attributes
Declaration
public List<OpenAttribute> Attribute { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<OpenAttribute>
Improve this Doc   View Source
Beam
List of Elements 1D
Declaration
public List<Beam> Beam { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Beam>
Improve this Doc   View Source
CombiInput
List of Combinations
Declaration
public List<CombiInput> CombiInput { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CombiInput>
Improve this Doc   View Source
ConcreteCheckSection
List of the concrete check section
Declaration
public List<CheckSection> ConcreteCheckSection { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CheckSection>
Improve this Doc   View Source
ConcreteSetup
Gets or sets the concrete member data
Declaration
public ConcreteSetup ConcreteSetup { get; set; }
Property Value
 Type |  Description
 ConcreteSetup
Improve this Doc   View Source
ConnectionPoint
List of Connection Points
Declaration
public List<ConnectionPoint> ConnectionPoint { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ConnectionPoint>
Improve this Doc   View Source
Connections
List of Connection data
Declaration
public List<ConnectionData> Connections { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ConnectionData>
Improve this Doc   View Source
ConnectionSetup
Information about Connection Setup
Declaration
public ConnectionSetup ConnectionSetup { get; set; }
Property Value
 Type |  Description
 ConnectionSetup
Improve this Doc   View Source
CrossSection
List of CrossSection
Declaration
public List<CrossSection> CrossSection { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CrossSection>
Improve this Doc   View Source
DappedEnd
List of dapped ends in Detail
Declaration
public List<DappedEnd> DappedEnd { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<DappedEnd>
Improve this Doc   View Source
DesignMember
Design Member
Declaration
public List<DesignMember> DesignMember { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<DesignMember>
Improve this Doc   View Source
Element1D
List of Elements 1D
Declaration
public List<Element1D> Element1D { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Element1D>
Improve this Doc   View Source
Element2D
List of Elements 2D
Declaration
public List<Element2D> Element2D { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Element2D>
Improve this Doc   View Source
HingeElement1D
List of hinge elements 1D
Declaration
public List<HingeElement1D> HingeElement1D { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<HingeElement1D>
Improve this Doc   View Source
CheckMember
List of the Check members
Declaration
public List<CheckMember> CheckMember { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CheckMember>
Improve this Doc   View Source
InitialImperfectionOfPoint
List of InitialmperfectionOfPoint
Declaration
public List<InitialImperfectionOfPoint> InitialImperfectionOfPoint { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<InitialImperfectionOfPoint>
Improve this Doc   View Source
ISDModel
List of Details
Declaration
public List<ISDModel> ISDModel { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ISDModel>
Improve this Doc   View Source
LineSegment3D
List of LineSegment3D
Declaration
public List<LineSegment3D> LineSegment3D { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<LineSegment3D>
Improve this Doc   View Source
LineSupportSegment
List of Line support on segment
Declaration
public List<LineSupportSegment> LineSupportSegment { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<LineSupportSegment>
Improve this Doc   View Source
LoadCase
List of Load cases
Declaration
public List<LoadCase> LoadCase { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<LoadCase>
Improve this Doc   View Source
LoadGroup
List of Load groups
Declaration
public List<LoadGroup> LoadGroup { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<LoadGroup>
Improve this Doc   View Source
LoadsInPoint
List of point load impulses in this load case
Declaration
public List<LoadInPoint> LoadsInPoint { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<LoadInPoint>
Improve this Doc   View Source
LoadsOnLine
List of line load impulses in this load case
Declaration
public List<LoadOnLine> LoadsOnLine { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<LoadOnLine>
Improve this Doc   View Source
LoadsOnSurface
List surafce load in this load case
Declaration
public List<LoadOnSurface> LoadsOnSurface { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<LoadOnSurface>
Improve this Doc   View Source
MatConcrete
List of MatConcrete
Declaration
public List<MatConcrete> MatConcrete { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<MatConcrete>
Improve this Doc   View Source
MatPrestressSteel
List of MatPrestressSteel
Declaration
public List<MatPrestressSteel> MatPrestressSteel { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<MatPrestressSteel>
Improve this Doc   View Source
MatReinforcement
List of MatReinforcement
Declaration
public List<MatReinforcement> MatReinforcement { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<MatReinforcement>
Improve this Doc   View Source
MatSteel
List of MatSteel
Declaration
public List<MatSteel> MatSteel { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<MatSteel>
Improve this Doc   View Source
Member1D
List of Member 1D
Declaration
public List<Member1D> Member1D { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Member1D>
Improve this Doc   View Source
Member2D
List of Member 2D
Declaration
public List<Member2D> Member2D { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Member2D>
Improve this Doc   View Source
Opening
List of openings for Detail
Declaration
public List<Opening> Opening { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Opening>
Improve this Doc   View Source
OriginSettings
Information about origin project
Declaration
public OriginSettings OriginSettings { get; set; }
Property Value
 Type |  Description
 OriginSettings
Improve this Doc   View Source
PatchDevice
List of dapped ends in Detail
Declaration
public List<PatchDevice> PatchDevice { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<PatchDevice>
Improve this Doc   View Source
Point3D
List of Point3D
Declaration
public List<Point3D> Point3D { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Point3D>
Improve this Doc   View Source
PointLoadsOnLine
List of point load impulses in this load case
Declaration
public List<PointLoadOnLine> PointLoadsOnLine { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<PointLoadOnLine>
Improve this Doc   View Source
PointOnLine3D
List of Point on line 3D
Declaration
public List<PointOnLine3D> PointOnLine3D { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<PointOnLine3D>
Improve this Doc   View Source
PointSupportNode
List of Point support in node
Declaration
public List<PointSupportNode> PointSupportNode { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<PointSupportNode>
Improve this Doc   View Source
PolyLine3D
List of PolyLine3D
Declaration
public List<PolyLine3D> PolyLine3D { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<PolyLine3D>
Improve this Doc   View Source
ProjectData
Gets or sets the projet data
Declaration
public ProjectData ProjectData { get; set; }
Property Value
 Type |  Description
 ProjectData
Improve this Doc   View Source
ProjectDataConcrete
Gets or sets the projet data concrete
Declaration
public ProjectDataConcrete ProjectDataConcrete { get; set; }
Property Value
 Type |  Description
 ProjectDataConcrete
Improve this Doc   View Source
RebarGeneral
Gets or sets the rebar General collection
Declaration
public List<RebarGeneral> RebarGeneral { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<RebarGeneral>
Improve this Doc   View Source
RebarShape
Gets or sets the rebars shapes
Declaration
public List<RebarShape> RebarShape { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<RebarShape>
Improve this Doc   View Source
RebarSingle
Gets or sets the rebar single collection
Declaration
public List<RebarSingle> RebarSingle { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<RebarSingle>
Improve this Doc   View Source
RebarStirrups
Gets or sets the rebar group (stirrups) collection
Declaration
public List<RebarStirrups> RebarStirrups { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<RebarStirrups>
Improve this Doc   View Source
Region3D
List of Region3D
Declaration
public List<Region3D> Region3D { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Region3D>
Improve this Doc   View Source
ReinforcedCrossSection
List of Reinforced CrossSection
Declaration
public List<ReinforcedCrossSection> ReinforcedCrossSection { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReinforcedCrossSection>
Improve this Doc   View Source
Reinforcement
List of reinforcement in IDEA StatiCa Detail
Declaration
public List<Reinforcement> Reinforcement { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Reinforcement>
Improve this Doc   View Source
ResultClass
Result Class
Declaration
public List<ResultClass> ResultClass { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ResultClass>
Improve this Doc   View Source
RigidLink
List of Rigid link
Declaration
public List<RigidLink> RigidLink { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<RigidLink>
Improve this Doc   View Source
Settlements
Settlements in this load case
Declaration
public List<Settlement> Settlements { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Settlement>
Improve this Doc   View Source
StrainLoadsOnLine
List of generalized strain load impulses along the line in this load case.
Declaration
public List<StrainLoadOnLine> StrainLoadsOnLine { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<StrainLoadOnLine>
Improve this Doc   View Source
SubStructure
Design Member
Declaration
public List<SubStructure> SubStructure { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<SubStructure>
Improve this Doc   View Source
TemperatureLoadsOnLine
List of temperature load in this load case
Declaration
public List<TemperatureLoadOnLine> TemperatureLoadsOnLine { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<TemperatureLoadOnLine>
Improve this Doc   View Source
Tendon
Tendon
Declaration
public List<Tendon> Tendon { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Tendon>
Improve this Doc   View Source
Version
Data format version
Declaration
public int Version { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Wall
List of Elements 2D
Declaration
public List<Wall> Wall { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Wall>
Methods
Improve this Doc   View Source
AddObject(OpenAttribute)
Add new atribute object into collections
Declaration
public int AddObject(OpenAttribute obj)
Parameters
 Type |  Name |  Description
 OpenAttribute |  obj
Added object
Returns
 Type |  Description
 System.Int32
Return value 0 - OK, -1 - false
Improve this Doc   View Source
AddObject(OpenElementId)
Add new object into collections
Declaration
public int AddObject(OpenElementId obj)
Parameters
 Type |  Name |  Description
 OpenElementId |  obj
Added object
Returns
 Type |  Description
 System.Int32
Return value 0 - OK, -1 - duplicit Id, -10 - the type of object there is not in the data colections
Remarks
If the obj.Id is set to zero or lesser, this method finds the first available free Id and sets it into the obj.Id.
Improve this Doc   View Source
GetExistingObject(OpenElementId)
Add new object into collections
Declaration
public OpenElementId GetExistingObject(OpenElementId obj)
Parameters
 Type |  Name |  Description
 OpenElementId |  obj
Added object
Returns
 Type |  Description
 OpenElementId
Return value 0 - OK, -1 - duplicit Id, -10 - the type of object there is not in the data colections
Remarks
If the obj.Id is set to zero or lesser, this method finds the first available free Id and sets it into the obj.Id.
Improve this Doc   View Source
GetMaxId(OpenElementId)
Get max Id value for specified type
Declaration
public int GetMaxId(OpenElementId obj)
Parameters
 Type |  Name |  Description
 OpenElementId |  obj
Object
Returns
 Type |  Description
 System.Int32
Max Id value or zero if don't any exists
Improve this Doc   View Source
GetMaxId(String)
Get max Id value for specified type
Declaration
public int GetMaxId(string typeName)
Parameters
 Type |  Name |  Description
 System.String |  typeName
Name of type
Returns
 Type |  Description
 System.Int32
Max Id value or zero if don't any exists
Improve this Doc   View Source
GetMaxId(Type)
Get max Id value for specified type
Declaration
public int GetMaxId(Type t)
Parameters
 Type |  Name |  Description
 System.Type |  t
Type
Returns
 Type |  Description
 System.Int32
Max Id value or zero if don't any exists
Improve this Doc   View Source
GetObject(ReferenceElement)
Gets the Open element object from the Reference element
Declaration
public OpenElementId GetObject(ReferenceElement element)
Parameters
 Type |  Name |  Description
 ReferenceElement |  element
Reference element
Returns
 Type |  Description
 OpenElementId
The instance of OpenElementId object
Improve this Doc   View Source
LoadFromStream(Stream)
Creates the instance of Open Model from the stream
Declaration
public static OpenModel LoadFromStream(Stream xmlFileStream)
Parameters
 Type |  Name |  Description
 System.IO.Stream |  xmlFileStream
The input stream
Returns
 Type |  Description
 OpenModel
The new instance of Open Model
Improve this Doc   View Source
LoadFromString(String)
Creates the instance of Open Model from xml string
Declaration
public static OpenModel LoadFromString(string xmlString)
Parameters
 Type |  Name |  Description
 System.String |  xmlString
The input string
Returns
 Type |  Description
 OpenModel
The new instance of Open Model
Improve this Doc   View Source
LoadFromXmlFile(String)
Creates the instance of Open Model from the XML file
Declaration
public static OpenModel LoadFromXmlFile(string xmlFileName)
Parameters
 Type |  Name |  Description
 System.String |  xmlFileName
XML file name
Returns
 Type |  Description
 OpenModel
Open Model or null
Improve this Doc   View Source
ReferenceElementsReconstruction()
Should be called after deserialization of the open model from xml
Declaration
public void ReferenceElementsReconstruction()
Improve this Doc   View Source
SaveToXmlFile(String)
Saves content into file as a XML format
Declaration
public bool SaveToXmlFile(string xmlFileName)
Parameters
 Type |  Name |  Description
 System.String |  xmlFileName
XML file name
Returns
 Type |  Description
 System.Boolean
True if succeeded
 Improve this Doc
 View Source